In [3]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a','b','c']
list = [10,20,30]
my_arr = np.array([10,20,30])
d ={1:10,2:20,3:30}

In [5]:

pd.Series(list,index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_arr,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(d)

1    10
2    20
3    30
dtype: int64

In [8]:
import numpy as np
import pandas as pd

In [9]:
data = {
    'Name':['John','Anna','Peter','Linda'],
    'Age':[28,39,43,25],
    'City':['New York','Paris','Berlin','London'],
    'Salary':[65000,70000,62000,65000]
}

In [10]:
df=pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   39     Paris   70000
2  Peter   43    Berlin   62000
3  Linda   25    London   65000

In [11]:
list1 = [
    ['John',34,'New York',65888],
    ['Anna',34,'Paris',7000],
    ['peter',24,'Berlin',65777],
    ['Linda',22,'London',87777]
    ]
df=pd.DataFrame(list1)
column=['Name','Age','City','Salary']
df=pd.DataFrame(list1,columns=column)
df

    Name  Age      City  Salary
0   John   34  New York   65888
1   Anna   34     Paris    7000
2  peter   24    Berlin   65777
3  Linda   22    London   87777

In [12]:
df[['Name','City']]

    Name      City
0   John  New York
1   Anna     Paris
2  peter    Berlin
3  Linda    London

In [13]:
df["Designation"] = ['Doctor','Engineer','Police','Data analytics']
df

    Name  Age      City  Salary     Designation
0   John   34  New York   65888          Doctor
1   Anna   34     Paris    7000        Engineer
2  peter   24    Berlin   65777          Police
3  Linda   22    London   87777  Data analytics

In [14]:
df=df.drop('Designation',axis=1)
df

    Name  Age      City  Salary
0   John   34  New York   65888
1   Anna   34     Paris    7000
2  peter   24    Berlin   65777
3  Linda   22    London   87777

In [15]:
df.loc[[0,1]]

   Name  Age      City  Salary
0  John   34  New York   65888
1  Anna   34     Paris    7000

In [16]:
df.iloc[3]

Name       Linda
Age           22
City      London
Salary     87777
Name: 3, dtype: object

In [17]:
df.loc[[0,1]][['City','Salary']]

       City  Salary
0  New York   65888
1     Paris    7000

In [18]:
df.loc[[2,1]][['Name','Age']]

    Name  Age
2  peter   24
1   Anna   34

In [19]:
df

    Name  Age      City  Salary
0   John   34  New York   65888
1   Anna   34     Paris    7000
2  peter   24    Berlin   65777
3  Linda   22    London   87777

In [20]:
df[df['Age']>30]

   Name  Age      City  Salary
0  John   34  New York   65888
1  Anna   34     Paris    7000

In [21]:
df[(df['Age']>30) & (df['City'] == 'Paris')]

   Name  Age   City  Salary
1  Anna   34  Paris    7000

In [22]:
import numpy as np
import pandas as pd
data={
    'A':[1,2,np.nan,4,5],
    'B':[1,2,3,4,5],
    'C':[1,2,3,np.nan,np.nan],
    'D':[1,np.nan,np.nan,np.nan,5]
}
df=pd.DataFrame(data)
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [23]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [24]:
df.isna().sum()

A    1
B    0
C    2
D    3
dtype: int64

In [25]:
df.isna().any() #tell that atleast one column exist a null value

A     True
B    False
C     True
D     True
dtype: bool

In [26]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [27]:
df.dropna()

     A  B    C    D
0  1.0  1  1.0  1.0

In [28]:
df.dropna(thresh=3)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

In [29]:
df.fillna(0)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [30]:
value={'A':0,'B':100,'C':300,'D':400}
df.fillna(value=value)

     A  B      C      D
0  1.0  1    1.0    1.0
1  2.0  2    2.0  400.0
2  0.0  3    3.0  400.0
3  4.0  4  300.0  400.0
4  5.0  5  300.0    5.0

In [31]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [32]:
df.fillna(df.mean())

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  3.0
2  3.0  3  3.0  3.0
3  4.0  4  2.0  3.0
4  5.0  5  2.0  5.0

In [33]:
import numpy as np
import pandas as pd

In [34]:

df1 = pd.DataFrame({
    'EmployeeID': [101, 102, 103, 104,107],
    'Name': ['Alice', 'Bob', 'Charlie', 'David','pat'],
    'Department': ['HR', 'IT', 'Finance', 'Marketing','HR']
})


df2 = pd.DataFrame({
    'EmployeeID': [101, 102, 103, 105,106],
    'Salary': [50000, 60000, 55000, 65000,70000],
    'Bonus': [5000, 6000, 5500, 7000,5000]
})

In [35]:
df1

   EmployeeID     Name Department
0         101    Alice         HR
1         102      Bob         IT
2         103  Charlie    Finance
3         104    David  Marketing
4         107      pat         HR

In [36]:
df2

   EmployeeID  Salary  Bonus
0         101   50000   5000
1         102   60000   6000
2         103   55000   5500
3         105   65000   7000
4         106   70000   5000

In [37]:
pd.merge(df1,df2,on='EmployeeID',how='inner')

   EmployeeID     Name Department  Salary  Bonus
0         101    Alice         HR   50000   5000
1         102      Bob         IT   60000   6000
2         103  Charlie    Finance   55000   5500

In [38]:
pd.merge(df1,df2,on='EmployeeID',how='outer')

   EmployeeID     Name Department   Salary   Bonus
0         101    Alice         HR  50000.0  5000.0
1         102      Bob         IT  60000.0  6000.0
2         103  Charlie    Finance  55000.0  5500.0
3         104    David  Marketing      NaN     NaN
4         105      NaN        NaN  65000.0  7000.0
5         106      NaN        NaN  70000.0  5000.0
6         107      pat         HR      NaN     NaN

In [39]:
pd.merge(df1,df2,on='EmployeeID',how='left')

   EmployeeID     Name Department   Salary   Bonus
0         101    Alice         HR  50000.0  5000.0
1         102      Bob         IT  60000.0  6000.0
2         103  Charlie    Finance  55000.0  5500.0
3         104    David  Marketing      NaN     NaN
4         107      pat         HR      NaN     NaN

In [40]:
pd.merge(df1,df2,on='EmployeeID',how='right')

   EmployeeID     Name Department  Salary  Bonus
0         101    Alice         HR   50000   5000
1         102      Bob         IT   60000   6000
2         103  Charlie    Finance   55000   5500
3         105      NaN        NaN   65000   7000
4         106      NaN        NaN   70000   5000

In [41]:
df3=pd.DataFrame({
    'A':['A0','A1','A2'],
    'B':['B0','B1','B2'],
    'C':['C0','C1','C2']
})

df4=pd.DataFrame({
    'A':['A3','A4','A5'],
    'B':['B3','B4','B5'],
    'C':['C3','C4','C5']
})

In [42]:
df3

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [43]:
df4

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [44]:
pd.concat([df3,df4])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [45]:
pd.concat([df3,df4],axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

In [46]:
df1=pd.DataFrame({
    'name':['Alice','Bob','Charlie']
},index=[1,2,3])

df2=pd.DataFrame({
    'score':[87,78,90]
},index=[2,3,4])

In [47]:
df1

      name
1    Alice
2      Bob
3  Charlie

In [48]:
df2

   score
2     87
3     78
4     90

In [49]:
df1.join(df2,how='outer')

      name  score
1    Alice    NaN
2      Bob   87.0
3  Charlie   78.0
4      NaN   90.0

In [50]:
import numpy as np
import pandas as pd

In [51]:
d={
    'category':['A','B','A','B','A','B','A','B'],
    'Store':['S1','S1','S2','S2','S1','S2','S2','S1'],
    'Sales':[100,200,150,250,120,180,200,300],
    'Ouantity':[10,15,12,18,8,20,15,25],
    'Data':pd.date_range('2023-01-01',periods=8)
}
df=pd.DataFrame(d)
df

  category Store  Sales  Ouantity       Data
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [52]:
cat=df.groupby('category')
for i,v in cat:
    print(i)
    print(v)

A
  category Store  Sales  Ouantity       Data
0        A    S1    100        10 2023-01-01
2        A    S2    150        12 2023-01-03
4        A    S1    120         8 2023-01-05
6        A    S2    200        15 2023-01-07
B
  category Store  Sales  Ouantity       Data
1        B    S1    200        15 2023-01-02
3        B    S2    250        18 2023-01-04
5        B    S2    180        20 2023-01-06
7        B    S1    300        25 2023-01-08

In [53]:
cat=df.groupby('category')['Sales'].sum()
cat

category
A    570
B    930
Name: Sales, dtype: int64

In [54]:
cat=df.groupby('Store')['Sales'].sum()
cat

Store
S1    720
S2    780
Name: Sales, dtype: int64

In [55]:
cat=df.groupby('Store')
for i,v in cat:
    print(i)
    print(v)

S1
  category Store  Sales  Ouantity       Data
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
4        A    S1    120         8 2023-01-05
7        B    S1    300        25 2023-01-08
S2
  category Store  Sales  Ouantity       Data
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07

In [56]:
cat=df.groupby(['category','Store'])['Sales'].sum()
cat

category  Store
A         S1       220
          S2       350
B         S1       500
          S2       430
Name: Sales, dtype: int64

In [57]:
df['Sales'].mean()

np.float64(187.5)

In [58]:
df['Sales'].median()

np.float64(190.0)

In [59]:
df['Sales'].mode()

0    200
Name: Sales, dtype: int64

In [60]:
df['Sales'].min()

np.int64(100)

In [61]:
df['Sales'].max()

np.int64(300)

In [62]:
df['Sales'].std()

np.float64(66.06274074155351)

In [63]:
df['Sales'].agg(['mean','sum','min','max'])

mean     187.5
sum     1500.0
min      100.0
max      300.0
Name: Sales, dtype: float64

In [64]:
df['Sales'].std()

np.float64(66.06274074155351)

In [65]:
import pandas as pd
import numpy as np

In [66]:
data = {
    'Region': ['North', 'South', 'East', 'West', 'North', 'South', 'East', 'West'],
    'Salesperson': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hank'],
    'Product': ['Laptop', 'Laptop', 'Tablet', 'Tablet', 'Phone', 'Phone', 'Laptop', 'Tablet'],
    'Units_Sold': [120, 150, 90, 130, 160, 100, 200, 170],
    'Revenue': [120000, 150000, 90000, 130000, 160000, 100000, 200000, 170000]
}

df = pd.DataFrame(data)
print(df)

  Region Salesperson Product  Units_Sold  Revenue
0  North       Alice  Laptop         120   120000
1  South         Bob  Laptop         150   150000
2   East     Charlie  Tablet          90    90000
3   West       David  Tablet         130   130000
4  North         Eve   Phone         160   160000
5  South       Frank   Phone         100   100000
6   East       Grace  Laptop         200   200000
7   West        Hank  Tablet         170   170000

In [67]:
pd.pivot_table(df,values='Revenue',index='Region',columns='Product')

Product    Laptop     Phone    Tablet
Region
East     200000.0       NaN   90000.0
North    120000.0  160000.0       NaN
South    150000.0  100000.0       NaN
West          NaN       NaN  150000.0

In [68]:
pd.pivot_table(df,values=['Revenue','Units_Sold'],index='Region',columns='Product')

          Revenue                     Units_Sold
Product    Laptop     Phone    Tablet     Laptop  Phone Tablet
Region
East     200000.0       NaN   90000.0      200.0    NaN   90.0
North    120000.0  160000.0       NaN      120.0  160.0    NaN
South    150000.0  100000.0       NaN      150.0  100.0    NaN
West          NaN       NaN  150000.0        NaN    NaN  150.0

In [69]:
pd.crosstab(df['Region'],df['Product'])

Product  Laptop  Phone  Tablet
Region
East          1      0       1
North         1      1       0
South         1      1       0
West          0      0       2

In [70]:
import numpy as np
import pandas as pd

In [71]:
df=pd.DataFrame({
    'A':[1,2,3,4,5],
    'B':[10,20,30,40,50],
    'C':[100,200,300,400,500]
})
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [72]:
df.shape

(5, 3)

In [73]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [75]:
df.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [76]:
df['A']=df['A']+10

In [77]:
def square(x):
    return x**2

In [78]:
df['Square of B']=df['B'].apply(square)

In [79]:
df

    A   B    C  Square of B
0  11  10  100          100
1  12  20  200          400
2  13  30  300          900
3  14  40  400         1600
4  15  50  500         2500